Revit 2024 API
DividedPath.MaximumDistance Property
 The maximum distance is used when the layout is set to 'MaximumSpacing'. When that layout rule is used the distance between points will not exceed this value. The measurement type determines how the distance is measured.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public double MaximumDistance { get; set; }
Visual Basic
Public Property MaximumDistance As Double
	Get
	Set
Visual C++
public:
property double MaximumDistance {
	double get ();
	void set (double value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: The maximumDistance is too small.
See Also
DividedPath Class
Autodesk.Revit.DB Namespace